# ParameterValue Properties

---
The ParameterValue type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ParameterValue Class
Autodesk.Revit.DB Namespace